app/Models/PenggunaModel.php

    public function getPengguna()
    {
        $query = $this->db->table('users');
        $query->select('*');
        $query->where('status_cd', 'normal');
        $query->orderBy('user_id', 'DESC');
        $return = $query->get();
---
SELECT *
FROM `users`
WHERE `status_cd` = 'normal'
ORDER BY `user_id` DESC

    public function getPerson()
    {
        $query = $this->db->table('users a');
        $query->select('a.user_id,a.id_person,a.username,a.email,a.telp,a.is_active,a.created_dttm,b.nama_lengkap,b.nik,b.jenis_kelamin,b.alamat,b.created_dttm');
        $query->join('persons b', 'b.person_id = a.id_person', 'left');
        $query->where('a.status_cd', 'normal');
        $query->orderBy('a.user_id', 'DESC');
        $return = $query->get();
---
SELECT `a`.`user_id`, `a`.`id_person`, `a`.`username`, `a`.`email`, `a`.`telp`, `a`.`is_active`, `a`.`created_dttm`, `b`.`nama_lengkap`, `b`.`nik`, `b`.`jenis_kelamin`, `b`.`alamat`, `b`.`created_dttm`
FROM `users` `a`
LEFT JOIN `persons` `b` ON `b`.`person_id` = `a`.`id_person`
WHERE `a`.`status_cd` = 'normal'
ORDER BY `a`.`user_id` DESC